package com;

public class Demo {

    public static String peremenaTime(){

        return "Понедельник - Пятница\n" +
                "1. " +
                "8.15 - 9.00\n" +
                "2. " +
                "9.00 - 9.45\n" +
                "перемена 10 минут\n" +
                "3. " +
                "9.55 - 10.40\n" +
                "4. " +
                "10.40 - 11.25\n" +
                "перемена 30 минут\n" +
                "5. " +
                "11.55 - 12.40\n" +
                "6. " +
                "12.40 - 13.25\n" +
                "перемена 30 минут\n" +
                "7. " +
                "13.55 - 14.40\n" +
                "8. " +
                "14.40 - 15.25\n" +
                "перемена 15 минут\n" +
                "9. " +
                "15.40 - 16.25\n" +
                "10. " +
                "16.25 - 17.10\n" +
                "перемена 10 минут\n" +
                "11. " +
                "17.20 - 18.05\n" +
                "12. " +
                "18.05 - 18.50\n";
    }



    public static String timePeremenaSubbota(){

        return "Суббота\n" +
                "1. " +
                "8.15 - 9.00\n" +
                "2. " +
                "9.00 - 9.45\n" +
                "перемена 5 минут\n" +
                "3. " +
                "9.50 - 10.35\n" +
                "4. " +
                "10.35 - 11.20\n" +
                "перемена 30 минут\n" +
                "5. " +
                "11.50 - 12.35\n" +
                "6. " +
                "12.35 - 13.20\n" +
                "перемена 10 минут\n" +
                "7. " +
                "13.30 - 14.15\n" +
                "8. " +
                "14.15 - 15.00\n" +
                "перемена 10 минут\n" +
                "9. " +
                "15.10 - 15.55\n" +
                "10. " +
                "15.55 - 16.40\n" +
                "перемена 5 минут\n" +
                "11. " +
                "16.45 - 17.30\n" +
                "12. " +
                "17.30 - 18.15\n";


    }


    public static String config(){


        return "# Address mysql://dataBase:port/dataBaseName + ?\n" +
                "mysql://localhost:3306/mainData?\n" +
                "# User name\n" +
                "root\n" +
                "# Password\n" +
                "admin\n" +
                "# Token\n" +
                "ad8a1812febce75de10b71933654bb6e51e7ab4c621048ccf44581f55f9840d3023fdbeed60d0c4dc1c04\n" +
                "# Id\n" +
                "172020474";


    }

}
